<template>
  <!-- 播放标签 -->
  <div class="player">
    <aplayer :audio="audio"
             :lrcType="1"
             :fixed="true"
             :mini="true"
             :autoplay="true" />
  </div>
</template>

<script>
export default {
  name: 'audio',
  // data () {
  //   return {
  //     audio: [
  //       {
  //         name: '七友',
  //         artist: '梁汉文',
  //         url: 'http://m8.music.126.net/20210627225233/97e23d8725bb717b1867e5079c397b24/ymusic/c7de/e954/eba0/42b0bedb06d9e2787b2c1f92ac780a11.mp3',
  //         cover: 'https://p1.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
  //         lrc: '[00:00.000] 作曲 : 雷颂德\n[00:05.24]编曲 : 雷颂德\n[00:08.24]监制 : 雷颂德\n[00:25.24]为了她 又再勉强去谈天论爱\n[00:30.60]又再振作去慰解他人\n[00:34.20]如难复合便尽早放开\n[00:37.45]凡事看开\n[00:39.60]又再讲 没有情人时还可自爱\n[00:44.95]忘掉或是为自己感慨\n[00:48.20]笑住说沉沦那些苦海\n[00:52.40]会有害\n[00:54.40]因为我坚强到利用自己的痛心\n[00:58.85]转换成爱心\n[01:01.65]抵我对她操心\n[01:04.00]已记不起我也有权利爱人\n[01:07.85]谁人曾照顾过我的感受\n[01:11.36]待我温柔 吻过我伤口\n[01:15.51]能得到的安慰是失恋者得救后很感激忠诚的狗\n[01:22.16]谁人曾介意我也不好受\n[01:25.76]为我出头 碰过我的手\n[01:29.86]重生者走得的都走\n[01:33.21]谁人又为天使忧愁\n[01:36.86]甜言蜜语没有 但却有我这个好友\n[01:54.67]直到她 又再告诉我重新被爱\n[02:00.17]又再看透了我的将来\n[02:03.77]完成任务后大可喝采\n[02:07.12]无谓搭台\n[02:09.17]别怪她 就怪我永远难得被爱\n[02:14.52]然后自虐地赞她可爱\n[02:17.72]往日最彷徨那刻\n[02:21.07]好彩有我在\n[02:23.97]因为我坚强到利用自己的痛心\n[02:28.37]转换成爱心\n[02:31.12]抵我对她操心\n[02:33.62]已记不起我也有权利爱人\n[02:37.32]谁人曾照顾过我的感受\n[02:40.97]待我温柔 吻过我伤口\n[02:45.22]能得到的安慰是失恋者得救后很感激忠诚的狗\n[02:51.68]谁人曾介意我也不好受\n[02:55.28]为我出头 碰过我的手\n[02:59.53]重生者走得的都走\n[03:02.83]谁人又为天使忧愁\n[03:06.48]甜言蜜语没有 但却有我这个好友\n[03:17.34]白雪公主不多\n[03:19.59]认命扮矮人的有太多个\n[03:23.09]早有六个\n[03:24.79]多我这个不多\n[03:27.34]我太好心还是太傻\n[03:30.14]未问过她 有没有理我的感受\n[03:34.69]待我温柔 吻过我伤口\n[03:38.99]能得到的安慰是失恋者得救后很感激忠诚的狗\n[03:45.39]谁人曾介意我也不好受\n[03:48.94]为我出头 碰过我的手\n[03:53.14]重生者走得的都走\n[03:56.64]谁人又为天使忧愁\n[04:00.19]甜言蜜语没有 但却有我这个好友\n'
  //       },
  //       {
  //         // 初始歌曲数据
  //         name: '一事无成',
  //         artist: '周柏豪',
  //         url: 'http://m8.music.126.net/20210627224059/b48c0056e11e5cbb092e7bbce53d300c/ymusic/fed2/b9d1/ca87/9a70d2a013e3bdfb352eafb4509f81a7.mp3',
  //         cover: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
  //         lrc: '[00:00.000] 作词 : 黄伟文\n[00:01.000] 作曲 : 陈光荣\n[00:04.360]编曲 : 陈光荣\n[00:10.190]hi yeah! oh oh oh...\n[00:15.510]或许这故事亦是谁共你的故事吧\n[00:20.390]真的好想精于某事情 好想好好的打拼\n[00:25.160]可惜得到只有劣评 没有半粒星\n[00:29.630]真的不想早给你定型 笑我那么的拼命\n[00:34.550]几年来毫无成绩\n[00:37.010]地位未有跃升\n[00:38.820]高峰上不成 唯盼爱情顺景\n[00:43.270]成就在平凡里 那份温馨\n[00:47.790]我试着生性 但求父母亲高兴\n[00:52.810]假如凡事都失败 也许得爱恋先可以得胜\n[00:58.230]Do do do do do do do do do\n[01:01.787]即使险胜\n[01:03.049]Do do do do do do you mean everything to me\n[01:10.239]终于找到些紧要事情\n[01:12.689]施展天生的本领\n[01:15.049]可惜精于恋爱未曾令我变精英\n[01:19.679]给鼓掌的都非这类型\n[01:22.239]按世界标准鉴定\n[01:24.599]感情从来如旁枝\n[01:27.009]办大事至正经\n[01:28.769]得不到掌声得到温馨我爱这种清静\n[01:33.489]为什么 还提我 事情未完别坐定\n[01:37.660]我试着生性 但求父母亲高兴\n[01:42.729]假如凡事都失败 也许得爱恋先可以得胜\n[01:47.949]Listen to my feeling as a way listen to my feeling\n[01:51.470]都不算差劲\n[01:52.519]I want to scream go for your dream Ah ha ah ha ah ha\n[02:03.569]飞不起个个也说我脚又未踏实地\n[02:06.829]爱上你不过为逃避\n[02:09.188]我也告诉你我实在是着地\n[02:11.548]难成大器但我爱得起 Let\'s do it\n[02:16.729]真的好想精于某事情 好想好好的打拼\n[02:21.649]可惜得到只有劣评 没有半粒星\n[02:26.018]真的不想早给你定型 笑我那么的拼命\n[02:31.038]几年来毫无成绩 地位未有跃升\n[02:35.109]高峰上不成 唯盼爱情顺景\n[02:39.729]成就在平凡里 那份温馨\n[02:44.149]已试着生性 但求大众都尊敬\n[02:49.268]竟然凡事都失败 也许得爱恋先可以得胜\n[02:58.268]即使险胜\n[03:02.709]都不算差劲\n'
  //       },
  //       {
  //         name: '危险',
  //         artist: '梁博',
  //         url: 'http://m7.music.126.net/20210627224228/9f0c394eeaf75d025003c0f240c90a3a/ymusic/obj/w5zDlMODwrDDiGjCn8Ky/2470055304/2c01/cae5/be00/0d53dddc4f98cd571d582c1cb6c7ef8b.mp3',
  //         cover: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
  //         lrc: '[00:00.000] 作词 : 梁博\n[00:01.000] 作曲 : 梁博\n[00:04.67]\n[00:15.07]别为那摇曳的烛光畅所欲言\n[00:20.44]\n[00:22.49]别为那昂贵的红酒浑身发软\n[00:27.58]\n[00:29.64]你偏爱 他的一切\n[00:35.18]\n[00:37.11]你迷恋他的谎言\n[00:42.48]\n[00:48.38]他给你眩晕的感觉在人群中间\n[00:53.62]\n[00:55.56]你给他完美的配合已成为习惯\n[01:01.00]\n[01:03.07]你给他 无限的空间\n[01:08.68]\n[01:10.59]欣赏他 深沉的表演\n[01:15.86]\n[01:22.21]你看到的不是我心的颜色\n[01:26.89]\n[01:29.42]再靠近一些我没有那么危险\n[01:34.06]\n[01:36.93]我知道你害怕我冰冷的表情\n[01:41.98]\n[01:44.19]是他们的笑让我看起来危险\n[01:49.11]\n[02:35.90]也许你现在正感觉疲惫不堪\n[02:40.87]\n[02:43.13]也许你现在正期待我的出现\n[02:48.06]\n[02:50.07]也许我 会奋不顾身\n[02:55.27]\n[02:57.05]也许我 会袖手旁观\n[03:03.26]\n[03:04.67]你看到的不是我心的颜色\n[03:09.36]\n[03:11.97]再靠近一些我没有那么危险\n[03:16.29]\n[03:19.24]我知道你害怕我冰冷的表情\n[03:23.95]\n[03:25.86]可是你 可是你\n[03:31.52]\n[03:33.72]你看到的不是我心的颜色\n[03:38.00]\n[03:40.68]再靠近一些我没有那么危险\n[03:45.03]\n[03:47.81]我知道你害怕我冰冷的表情\n[03:52.36]\n[03:55.21]是他们的笑让我看起来危险\n[03:59.76]\n[04:02.30]是他们的笑让我看起来危险\n[04:07.12]\n[04:09.70]是他们的笑让我看起来危险\n'
  //       },
  //       {
  //         name: '耿耿于怀',
  //         artist: '麦浚龙',
  //         url: 'http://m801.music.126.net/20210627225656/a4a4d988274c6f6e243b46a4dbe68530/jdymusic/obj/w5zDlMODwrDDiGjCn8Ky/1548924564/fc2b/de30/c855/e2c13b8f53cb7d65804fc7ed0391b549.mp3',
  //         cover: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
  //         lrc: '[00:00.000] 作词 : 黄伟文\n[00:01.000] 作曲 : 伍乐城\n[00:02.000] 编曲 : 伍乐城\n[00:05.420]编曲：伍乐城\n[00:12.610]监制：伍乐城\n[00:20.800]你 最近还好吗？ 尚爱看少女漫画吗？\n[00:27.230]最近 近乎没露面 你有新对象吗？\n[00:34.570]真想带你见见 我刚识到的她\n[00:38.420]我想听你意见 这算是病吧？\n[00:42.090]为何无论我 愿意怎样试 怎样也\n[00:45.960]不可一样爱慕她？\n[00:49.080]难道没练习太耐 感觉都追不回来\n[00:52.750]试图再 努力爱 也显得不自在\n[00:56.460]不懂得如何谈恋爱\n[01:00.079]还是我太爱你 对过去太放不开\n[01:03.648]难道是寂寞太耐 生锈的锁不能开\n[01:07.319]钥匙也 折断了 留在旧患所在\n[01:11.179]怀内 放满对你的爱\n[01:14.599]难怪跟谁也 再没法恋爱\n[01:33.388]我 有时仍很怕 路过你那从前的家\n[01:40.069]往事若然未落幕 再揭起有害吗？\n[01:47.449]真想带你见见 我刚识到的她\n[01:51.119]我想听你意见 这算是病吧？\n[01:55.039]为何无论我 愿意怎样试 怎样也\n[01:58.910]没令自己恋上她？\n[02:02.028]难道没练习太耐 感觉都追不回来\n[02:05.588]试图再 努力爱 也显得不自在\n[02:09.459]不懂得如何谈恋爱\n[02:13.078]还是我太爱你 对过去太放不开\n[02:16.649]难道是寂寞太耐 生锈的锁不能开\n[02:20.258]钥匙也 折断了 留在旧患所在\n[02:24.078]怀内 放满对你的爱\n[02:27.598]难怪跟谁也 再没法恋爱\n[02:45.399]难道没练习太耐 感觉都追不回来\n[02:49.468]试图再 努力爱 也显得不自在\n[02:53.188]耿耿于怀从前的爱\n[02:56.809]从没有 振作过 痛了再痛也应该\n[03:00.418]难道是寂寞太耐 生锈的锁不能开\n[03:04.157]往事却 似断箭 还剩下在体内\n[03:07.778]若怀内 放满对你的爱\n[03:11.199]害怕一直也 再没法恋爱\n'
  //       }
  //     ]
  //   }
  // },
  data () {
    return {
      audio:
      // {
      //   id: 26304100,
      //   // 初始歌曲数据
      //   name: '一事无成',
      //   artist: '周柏豪',
      //   url: '',
      //   cover: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
      //   lrc: '[00:00.000] 作词 : 黄伟文\n[00:01.000] 作曲 : 陈光荣\n[00:04.360]编曲 : 陈光荣\n[00:10.190]hi yeah! oh oh oh...\n[00:15.510]或许这故事亦是谁共你的故事吧\n[00:20.390]真的好想精于某事情 好想好好的打拼\n[00:25.160]可惜得到只有劣评 没有半粒星\n[00:29.630]真的不想早给你定型 笑我那么的拼命\n[00:34.550]几年来毫无成绩\n[00:37.010]地位未有跃升\n[00:38.820]高峰上不成 唯盼爱情顺景\n[00:43.270]成就在平凡里 那份温馨\n[00:47.790]我试着生性 但求父母亲高兴\n[00:52.810]假如凡事都失败 也许得爱恋先可以得胜\n[00:58.230]Do do do do do do do do do\n[01:01.787]即使险胜\n[01:03.049]Do do do do do do you mean everything to me\n[01:10.239]终于找到些紧要事情\n[01:12.689]施展天生的本领\n[01:15.049]可惜精于恋爱未曾令我变精英\n[01:19.679]给鼓掌的都非这类型\n[01:22.239]按世界标准鉴定\n[01:24.599]感情从来如旁枝\n[01:27.009]办大事至正经\n[01:28.769]得不到掌声得到温馨我爱这种清静\n[01:33.489]为什么 还提我 事情未完别坐定\n[01:37.660]我试着生性 但求父母亲高兴\n[01:42.729]假如凡事都失败 也许得爱恋先可以得胜\n[01:47.949]Listen to my feeling as a way listen to my feeling\n[01:51.470]都不算差劲\n[01:52.519]I want to scream go for your dream Ah ha ah ha ah ha\n[02:03.569]飞不起个个也说我脚又未踏实地\n[02:06.829]爱上你不过为逃避\n[02:09.188]我也告诉你我实在是着地\n[02:11.548]难成大器但我爱得起 Let\'s do it\n[02:16.729]真的好想精于某事情 好想好好的打拼\n[02:21.649]可惜得到只有劣评 没有半粒星\n[02:26.018]真的不想早给你定型 笑我那么的拼命\n[02:31.038]几年来毫无成绩 地位未有跃升\n[02:35.109]高峰上不成 唯盼爱情顺景\n[02:39.729]成就在平凡里 那份温馨\n[02:44.149]已试着生性 但求大众都尊敬\n[02:49.268]竟然凡事都失败 也许得爱恋先可以得胜\n[02:58.268]即使险胜\n[03:02.709]都不算差劲\n"},"klyric":{"version":22,"lyric":"[ti:一事无成]\n[ar:郑融、周柏豪]\n[co:陈光荣]\n[lr:黄伟文]\n[by:200183@网易云音乐_2]\n[#:http://music.163.com/#/song?id=26304100]\n[9694,10370](0,470)郑(0,5125)融(0,166)或(0,155)许(0,167)这(0,177)故(0,204)事(0,471)亦(0,222)是(0,215)谁(0,313)共(0,197)你(0,403)的(0,252)故(0,290)事(0,1536)吧\n[19764,2986](0,471)周(0,179)柏(0,246)豪(0,181)真(0,165)的(0,166)好(0,191)想(0,220)精(0,356)於(0,159)某(0,261)事(0,382)情\n[22450,2555](0,465)好(0,289)想(0,259)好(0,283)好(0,278)的(0,303)打(0,677)拚\n[24705,4343](0,676)郑(0,181)融(0,141)可(0,161)惜(0,152)得(0,234)到(0,211)只(0,238)有(0,181)劣(0,361)没(0,171)有(0,200)半(0,210)粒(0,1224)星\n[28748,3275](0,475)周(0,172)柏(0,287)豪(0,171)真(0,176)的(0,186)不(0,185)想(0,205)早(0,196)给(0,336)你(0,269)定(0,612)型\n[31726,2209](0,616)笑(0,348)我(0,251)那(0,316)麽(0,322)的(0,170)拚(0,177)命\n[33635,3181](0,769)郑(0,213)融(0,226)几(0,236)年(0,262)来(0,286)毫(0,268)无(0,335)成(0,579)绩\n[36516,2064](0,550)周(0,188)柏(0,172)豪(0,177)地(0,209)位(0,171)未(0,205)有(0,150)跃(0,239)升\n[38280,4856](0,811)郑(0,190)融(0,181)高(0,182)峰(0,161)上(0,165)不(0,170)成(0,782)唯(0,196)盼(0,449)爱(0,219)情(0,440)顺(0,903)景\n[42836,4306](0,508)成(0,547)就(0,420)在(0,175)平(0,421)凡(0,663)里(0,215)那(0,498)份(0,647)温(0,210)馨\n[46842,5810](0,452)周(0,170)柏(0,347)豪(0,191)我(0,161)试(0,488)着(0,574)生(0,1189)性(0,273)但(0,156)求(0,156)父(0,417)母(0,194)亲(0,415)高(0,625)兴\n[52352,5146](0,485)假(0,482)如(0,166)凡(0,166)事(0,141)都(0,171)失(0,1127)败(0,195)也(0,162)许(0,176)得(0,191)爱(0,195)恋(0,381)先(0,395)可(0,337)以(0,193)得(0,177)胜\n[57198,4544](0,981)郑(0,255)融(0,216)Do(0,1) (0,160)do(0,1) (0,400)lu(0,1) (0,575)do(0,1) (0,175)do(0,1) (0,472)lu(0,1) (0,210)do(0,1) (0,201)do(0,1) (0,890)lu\n[61442,2174](0,482)周(0,164)柏(0,170)豪(0,297)即(0,304)使(0,174)险(0,577)胜\n[62771,2834](0,461)郑(0,196)融(0,307)Do(0,1) (0,185)do(0,1) (0,197)do(0,1) (0,310)do(0,1) (0,1166)do\n[65305,3786](0,471)do(0,1) (0,168)you(0,1) (0,186)mean(0,1) (0,473)everything(0,1) (0,473)to(0,1) (0,2005)me\n[68791,3738](0,466)周(0,168)柏(0,467)豪(0,210)I(0,1) (0,173)Say(0,182)终(0,172)於(0,194)找(0,250)到(0,180)些(0,169)紧(0,195)要(0,263)事(0,644)情\n[72229,1998](0,519)施(0,357)展(0,211)天(0,340)生(0,183)的(0,159)本(0,227)领\n[73927,4329](0,1023)郑(0,166)融(0,153)可(0,194)惜(0,293)精(0,341)於(0,225)恋(0,300)爱(0,452)未(0,182)曾(0,174)令(0,214)我(0,246)变(0,195)精(0,165)英\n[77956,3444](0,1051)周(0,186)柏(0,211)豪(0,180)给(0,185)鼓(0,226)掌(0,248)的(0,265)都(0,282)非(0,258)这(0,195)类(0,152)型\n[81100,2580](0,905)按(0,225)世(0,366)界(0,274)标(0,302)准(0,264)鉴(0,237)定\n[83380,3417](0,974)郑(0,332)融(0,224)感(0,198)情(0,324)从(0,363)来(0,248)如(0,200)旁(0,549)枝\n[86497,1997](0,484)周(0,183)柏(0,163)豪(0,158)办(0,253)大(0,167)事(0,161)至(0,235)正(0,189)经\n[88194,4401](0,549)郑(0,235)融(0,185)得(0,182)不(0,174)到(0,211)掌(0,171)声(0,229)得(0,229)到(0,210)温(0,249)馨(0,258)我(0,240)爱(0,250)这(0,238)种(0,284)清(0,507)静\n[92295,4876](0,921)为(0,289)什(0,311)麽(0,565)还(0,329)提(0,288)我(0,610)事(0,293)情(0,312)未(0,320)完(0,297)别(0,184)坐(0,153)定\n[96871,4975](0,421)周(0,271)柏(0,190)豪(0,233)我(0,509)试(0,172)着(0,159)生(0,317)性(0,1181)但(0,385)求(0,187)父(0,187)母(0,312)亲(0,216)高(0,235)兴\n[101546,5581](0,971)假(0,259)如(0,251)凡(0,174)事(0,176)都(0,297)失(0,1216)败(0,258)也(0,321)许(0,202)得(0,181)爱(0,174)恋(0,193)先(0,199)可(0,273)以(0,201)得(0,227)胜\n[107678,1464](0,461)郑(0,176)融(0,201)Listen(0,1) (0,198)to(0,1) (0,214)my(0,1) (0,205)feelings\n[108842,2547](0,1123)as(0,1) (0,166)always(0,1) (0,182)listen(0,1) (0,708)to(0,1) (0,177)my(0,1) (0,185)feelings\n[111089,1924](0,678)周(0,161)柏(0,191)豪(0,180)都(0,191)不(0,190)算(0,177)差(0,148)劲\n[112713,4222](0,481)郑(0,139)融(0,183)I(0,1) (0,452)want(0,1) (0,175)to(0,1) (0,199)scream(0,1) (0,267)go(0,1) (0,234)for(0,1) (0,245)your(0,1) (0,1839)dream\n[115721,1550](0,485)Ah(0,1) (0,195)ha(0,1) (0,228)ah(0,1) (0,219)ha(0,1) (0,219)ah(0,1) (0,195)ha\n[116971,9647](0,739)周(0,181)柏(0,176)豪(5407,180)飞(0,181)不(0,259)起(0,192)个(0,291)个(0,190)也(0,176)说(0,200)我(0,196)脚(0,195)又(0,202)未(0,204)踏(0,175)实(0,497)地\n[126318,1996](0,471)爱(0,205)上(0,225)你(0,239)不(0,233)过(0,196)为(0,201)逃(0,218)避\n[128014,3355](0,740)郑(0,125)融(0,214)我(0,210)也(0,191)告(0,156)诉(0,278)你(0,191)我(0,184)实(0,226)在(0,213)是(0,187)着(0,433)地\n[131069,3327](0,519)难(0,235)成(0,278)大(0,327)器(0,210)但(0,190)我(0,221)爱(0,201)得(0,222)起(0,313)Let(0,1) (0,190)s(0,1) (0,228)do(0,1) (0,182)it\n[134096,7375](0,2038)周(0,228)柏(0,177)豪(0,186)真(0,197)的(0,257)好(0,214)想(0,206)精(0,239)於(0,210)某(0,205)事(0,783)情(0,279)好(0,312)想(0,281)好(0,293)好(0,240)的(0,359)打(0,669)拚\n[141171,4821](0,572)可(0,294)惜(0,278)得(0,186)到(0,327)只(0,290)有(0,496)劣(0,213)而(0,212)没(0,257)有(0,275)半(0,201)粒(0,1213)星\n[145692,4733](0,498)真(0,178)的(0,322)不(0,200)想(0,224)早(0,186)给(0,298)你(0,291)定(0,612)型(0,301)笑(0,325)我(0,258)那(0,312)麽(0,296)的(0,183)拚(0,246)命\n[150125,4885](0,813)几(0,283)年(0,293)来(0,273)毫(0,278)无(0,260)成(0,941)绩(0,315)地(0,232)位(0,215)未(0,205)有(0,381)跃(0,393)升\n[154710,4796](0,522)郑(0,222)融(0,224)高(0,205)峰(0,196)上(0,171)不(0,1001)成(0,205)唯(0,508)盼(0,278)爱(0,307)情(0,298)顺(0,653)景\n[159206,4827](0,500)成(0,577)就(0,395)在(0,161)平(0,118)凡(0,1041)里(0,208)那(0,543)份(0,607)温(0,670)馨\n[163733,4347](0,563)周(0,195)柏(0,181)豪(0,425)已(0,547)试(0,537)着(0,157)生(0,184)性(0,323)但(0,219)求(0,201)大(0,195)众(0,188)都(0,237)尊(0,195)敬\n[167780,7194](0,1179)竟(0,249)然(0,542)凡(0,188)事(0,193)都(0,268)失(0,1090)败(0,225)也(0,228)许(0,278)得(0,283)爱(0,269)恋(0,334)先(0,188)可(0,195)以(0,204)得(0,1277)胜\n[177994,7926](0,492)即(0,189)使(0,402)险(7835,6834)胜\n',
      //   autoplay: true
      // }
      {
        id: 118261,
        name: '七友',
        artist: '梁汉文',
        url: 'http://m8.music.126.net/20210627225233/97e23d8725bb717b1867e5079c397b24/ymusic/c7de/e954/eba0/42b0bedb06d9e2787b2c1f92ac780a11.mp3',
        cover: 'https://p1.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
        lrc: '[00:00.000] 作曲 : 雷颂德\n[00:05.24]编曲 : 雷颂德\n[00:08.24]监制 : 雷颂德\n[00:25.24]为了她 又再勉强去谈天论爱\n[00:30.60]又再振作去慰解他人\n[00:34.20]如难复合便尽早放开\n[00:37.45]凡事看开\n[00:39.60]又再讲 没有情人时还可自爱\n[00:44.95]忘掉或是为自己感慨\n[00:48.20]笑住说沉沦那些苦海\n[00:52.40]会有害\n[00:54.40]因为我坚强到利用自己的痛心\n[00:58.85]转换成爱心\n[01:01.65]抵我对她操心\n[01:04.00]已记不起我也有权利爱人\n[01:07.85]谁人曾照顾过我的感受\n[01:11.36]待我温柔 吻过我伤口\n[01:15.51]能得到的安慰是失恋者得救后很感激忠诚的狗\n[01:22.16]谁人曾介意我也不好受\n[01:25.76]为我出头 碰过我的手\n[01:29.86]重生者走得的都走\n[01:33.21]谁人又为天使忧愁\n[01:36.86]甜言蜜语没有 但却有我这个好友\n[01:54.67]直到她 又再告诉我重新被爱\n[02:00.17]又再看透了我的将来\n[02:03.77]完成任务后大可喝采\n[02:07.12]无谓搭台\n[02:09.17]别怪她 就怪我永远难得被爱\n[02:14.52]然后自虐地赞她可爱\n[02:17.72]往日最彷徨那刻\n[02:21.07]好彩有我在\n[02:23.97]因为我坚强到利用自己的痛心\n[02:28.37]转换成爱心\n[02:31.12]抵我对她操心\n[02:33.62]已记不起我也有权利爱人\n[02:37.32]谁人曾照顾过我的感受\n[02:40.97]待我温柔 吻过我伤口\n[02:45.22]能得到的安慰是失恋者得救后很感激忠诚的狗\n[02:51.68]谁人曾介意我也不好受\n[02:55.28]为我出头 碰过我的手\n[02:59.53]重生者走得的都走\n[03:02.83]谁人又为天使忧愁\n[03:06.48]甜言蜜语没有 但却有我这个好友\n[03:17.34]白雪公主不多\n[03:19.59]认命扮矮人的有太多个\n[03:23.09]早有六个\n[03:24.79]多我这个不多\n[03:27.34]我太好心还是太傻\n[03:30.14]未问过她 有没有理我的感受\n[03:34.69]待我温柔 吻过我伤口\n[03:38.99]能得到的安慰是失恋者得救后很感激忠诚的狗\n[03:45.39]谁人曾介意我也不好受\n[03:48.94]为我出头 碰过我的手\n[03:53.14]重生者走得的都走\n[03:56.64]谁人又为天使忧愁\n[04:00.19]甜言蜜语没有 但却有我这个好友\n'
      }
    }
  },
  created () {
    this.$root.$on('songId', (value) => {
      console.log(value)
      this.playMusic(value)
    })
    // 获取歌曲信息
    this.$musicApi({
      url: '/song/detail',
      method: 'get',
      params: {
        ids: this.audio.id
      }
    }).then((res) => {
      this.audio.name = res.data.songs[0].name
      this.audio.artist = res.data.songs[0].ar[0].name
      this.audio.cover = res.data.songs[0].al.picUrl
      console.log(this.audio.name)
    })
    // 获取歌词
    this.$musicApi({
      url: '/lyric',
      method: 'get',
      params: {
        id: this.id
      }
    }).then((res) => {
      const lrc = (this.audio.lrc = res.data.lrc.lyric)
      this.audio.lrc = lrc
    })
    // }
    // 获取歌曲音源
    this.$musicApi({
      url: '/song/url',
      method: 'get',
      params: {
        id: this.audio.id
      }
    }).then((res) => {
      const url = res.data.data[0].url
      console.log(res.data.data[0].url)
      // 设置播放地址
      this.audio.url = url
    })
  },
  methods: {
    playMusic (songId) {
      this.$musicApi({
        url: '/song/detail',
        method: 'get',
        params: {
          ids: songId
        }
      }).then((res) => {
        this.audio.name = res.data.songs[0].name
        this.audio.artist = res.data.songs[0].ar[0].name
        this.audio.cover = res.data.songs[0].al.picUrl
        console.log(this.audio.name)
      })
      // 获取歌词
      this.$musicApi({
        url: '/lyric',
        method: 'get',
        params: {
          id: songId
        }
      }).then((res) => {
        const lrc = (this.audio.lrc = res.data.lrc.lyric)
        this.audio.lrc = lrc
      })
      // }
      // 获取歌曲音源
      this.$musicApi({
        url: '/song/url',
        method: 'get',
        params: {
          id: songId
        }
      }).then((res) => {
        const url = res.data.data[0].url
        console.log(res.data.data[0].url)
        // 设置播放地址
        this.audio.url = url
      })
    }
  }
}
</script>

<style scoped>
</style>
