<template>
  <!-- 播放标签 -->
  <div class="player">
    <aplayer
      :audio="audio"
      :lrcType="1"
      :fixed="true"
      :mini="true"
      :autoplay="true"
      :list="musicList"
    />
  </div>
</template>

<script>
export default {
  name: 'audio',
  data () {
    return {
      id: 26304100,
      audio: {
        // 初始歌曲数据
        name: '一事无成',
        artist: '周柏豪',
        url: '',
        cover: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', // prettier-ignore
        lrc: '[00:00.000] 作词 : 黄伟文\n[00:01.000] 作曲 : 陈光荣\n[00:04.360]编曲 : 陈光荣\n[00:10.190]hi yeah! oh oh oh...\n[00:15.510]或许这故事亦是谁共你的故事吧\n[00:20.390]真的好想精于某事情 好想好好的打拼\n[00:25.160]可惜得到只有劣评 没有半粒星\n[00:29.630]真的不想早给你定型 笑我那么的拼命\n[00:34.550]几年来毫无成绩\n[00:37.010]地位未有跃升\n[00:38.820]高峰上不成 唯盼爱情顺景\n[00:43.270]成就在平凡里 那份温馨\n[00:47.790]我试着生性 但求父母亲高兴\n[00:52.810]假如凡事都失败 也许得爱恋先可以得胜\n[00:58.230]Do do do do do do do do do\n[01:01.787]即使险胜\n[01:03.049]Do do do do do do you mean everything to me\n[01:10.239]终于找到些紧要事情\n[01:12.689]施展天生的本领\n[01:15.049]可惜精于恋爱未曾令我变精英\n[01:19.679]给鼓掌的都非这类型\n[01:22.239]按世界标准鉴定\n[01:24.599]感情从来如旁枝\n[01:27.009]办大事至正经\n[01:28.769]得不到掌声得到温馨我爱这种清静\n[01:33.489]为什么 还提我 事情未完别坐定\n[01:37.660]我试着生性 但求父母亲高兴\n[01:42.729]假如凡事都失败 也许得爱恋先可以得胜\n[01:47.949]Listen to my feeling as a way listen to my feeling\n[01:51.470]都不算差劲\n[01:52.519]I want to scream go for your dream Ah ha ah ha ah ha\n[02:03.569]飞不起个个也说我脚又未踏实地\n[02:06.829]爱上你不过为逃避\n[02:09.188]我也告诉你我实在是着地\n[02:11.548]难成大器但我爱得起 Let\'s do it\n[02:16.729]真的好想精于某事情 好想好好的打拼\n[02:21.649]可惜得到只有劣评 没有半粒星\n[02:26.018]真的不想早给你定型 笑我那么的拼命\n[02:31.038]几年来毫无成绩 地位未有跃升\n[02:35.109]高峰上不成 唯盼爱情顺景\n[02:39.729]成就在平凡里 那份温馨\n[02:44.149]已试着生性 但求大众都尊敬\n[02:49.268]竟然凡事都失败 也许得爱恋先可以得胜\n[02:58.268]即使险胜\n[03:02.709]都不算差劲\n"},"klyric":{"version":22,"lyric":"[ti:一事无成]\n[ar:郑融、周柏豪]\n[co:陈光荣]\n[lr:黄伟文]\n[by:200183@网易云音乐_2]\n[#:http://music.163.com/#/song?id=26304100]\n[9694,10370](0,470)郑(0,5125)融(0,166)或(0,155)许(0,167)这(0,177)故(0,204)事(0,471)亦(0,222)是(0,215)谁(0,313)共(0,197)你(0,403)的(0,252)故(0,290)事(0,1536)吧\n[19764,2986](0,471)周(0,179)柏(0,246)豪(0,181)真(0,165)的(0,166)好(0,191)想(0,220)精(0,356)於(0,159)某(0,261)事(0,382)情\n[22450,2555](0,465)好(0,289)想(0,259)好(0,283)好(0,278)的(0,303)打(0,677)拚\n[24705,4343](0,676)郑(0,181)融(0,141)可(0,161)惜(0,152)得(0,234)到(0,211)只(0,238)有(0,181)劣(0,361)没(0,171)有(0,200)半(0,210)粒(0,1224)星\n[28748,3275](0,475)周(0,172)柏(0,287)豪(0,171)真(0,176)的(0,186)不(0,185)想(0,205)早(0,196)给(0,336)你(0,269)定(0,612)型\n[31726,2209](0,616)笑(0,348)我(0,251)那(0,316)麽(0,322)的(0,170)拚(0,177)命\n[33635,3181](0,769)郑(0,213)融(0,226)几(0,236)年(0,262)来(0,286)毫(0,268)无(0,335)成(0,579)绩\n[36516,2064](0,550)周(0,188)柏(0,172)豪(0,177)地(0,209)位(0,171)未(0,205)有(0,150)跃(0,239)升\n[38280,4856](0,811)郑(0,190)融(0,181)高(0,182)峰(0,161)上(0,165)不(0,170)成(0,782)唯(0,196)盼(0,449)爱(0,219)情(0,440)顺(0,903)景\n[42836,4306](0,508)成(0,547)就(0,420)在(0,175)平(0,421)凡(0,663)里(0,215)那(0,498)份(0,647)温(0,210)馨\n[46842,5810](0,452)周(0,170)柏(0,347)豪(0,191)我(0,161)试(0,488)着(0,574)生(0,1189)性(0,273)但(0,156)求(0,156)父(0,417)母(0,194)亲(0,415)高(0,625)兴\n[52352,5146](0,485)假(0,482)如(0,166)凡(0,166)事(0,141)都(0,171)失(0,1127)败(0,195)也(0,162)许(0,176)得(0,191)爱(0,195)恋(0,381)先(0,395)可(0,337)以(0,193)得(0,177)胜\n[57198,4544](0,981)郑(0,255)融(0,216)Do(0,1) (0,160)do(0,1) (0,400)lu(0,1) (0,575)do(0,1) (0,175)do(0,1) (0,472)lu(0,1) (0,210)do(0,1) (0,201)do(0,1) (0,890)lu\n[61442,2174](0,482)周(0,164)柏(0,170)豪(0,297)即(0,304)使(0,174)险(0,577)胜\n[62771,2834](0,461)郑(0,196)融(0,307)Do(0,1) (0,185)do(0,1) (0,197)do(0,1) (0,310)do(0,1) (0,1166)do\n[65305,3786](0,471)do(0,1) (0,168)you(0,1) (0,186)mean(0,1) (0,473)everything(0,1) (0,473)to(0,1) (0,2005)me\n[68791,3738](0,466)周(0,168)柏(0,467)豪(0,210)I(0,1) (0,173)Say(0,182)终(0,172)於(0,194)找(0,250)到(0,180)些(0,169)紧(0,195)要(0,263)事(0,644)情\n[72229,1998](0,519)施(0,357)展(0,211)天(0,340)生(0,183)的(0,159)本(0,227)领\n[73927,4329](0,1023)郑(0,166)融(0,153)可(0,194)惜(0,293)精(0,341)於(0,225)恋(0,300)爱(0,452)未(0,182)曾(0,174)令(0,214)我(0,246)变(0,195)精(0,165)英\n[77956,3444](0,1051)周(0,186)柏(0,211)豪(0,180)给(0,185)鼓(0,226)掌(0,248)的(0,265)都(0,282)非(0,258)这(0,195)类(0,152)型\n[81100,2580](0,905)按(0,225)世(0,366)界(0,274)标(0,302)准(0,264)鉴(0,237)定\n[83380,3417](0,974)郑(0,332)融(0,224)感(0,198)情(0,324)从(0,363)来(0,248)如(0,200)旁(0,549)枝\n[86497,1997](0,484)周(0,183)柏(0,163)豪(0,158)办(0,253)大(0,167)事(0,161)至(0,235)正(0,189)经\n[88194,4401](0,549)郑(0,235)融(0,185)得(0,182)不(0,174)到(0,211)掌(0,171)声(0,229)得(0,229)到(0,210)温(0,249)馨(0,258)我(0,240)爱(0,250)这(0,238)种(0,284)清(0,507)静\n[92295,4876](0,921)为(0,289)什(0,311)麽(0,565)还(0,329)提(0,288)我(0,610)事(0,293)情(0,312)未(0,320)完(0,297)别(0,184)坐(0,153)定\n[96871,4975](0,421)周(0,271)柏(0,190)豪(0,233)我(0,509)试(0,172)着(0,159)生(0,317)性(0,1181)但(0,385)求(0,187)父(0,187)母(0,312)亲(0,216)高(0,235)兴\n[101546,5581](0,971)假(0,259)如(0,251)凡(0,174)事(0,176)都(0,297)失(0,1216)败(0,258)也(0,321)许(0,202)得(0,181)爱(0,174)恋(0,193)先(0,199)可(0,273)以(0,201)得(0,227)胜\n[107678,1464](0,461)郑(0,176)融(0,201)Listen(0,1) (0,198)to(0,1) (0,214)my(0,1) (0,205)feelings\n[108842,2547](0,1123)as(0,1) (0,166)always(0,1) (0,182)listen(0,1) (0,708)to(0,1) (0,177)my(0,1) (0,185)feelings\n[111089,1924](0,678)周(0,161)柏(0,191)豪(0,180)都(0,191)不(0,190)算(0,177)差(0,148)劲\n[112713,4222](0,481)郑(0,139)融(0,183)I(0,1) (0,452)want(0,1) (0,175)to(0,1) (0,199)scream(0,1) (0,267)go(0,1) (0,234)for(0,1) (0,245)your(0,1) (0,1839)dream\n[115721,1550](0,485)Ah(0,1) (0,195)ha(0,1) (0,228)ah(0,1) (0,219)ha(0,1) (0,219)ah(0,1) (0,195)ha\n[116971,9647](0,739)周(0,181)柏(0,176)豪(5407,180)飞(0,181)不(0,259)起(0,192)个(0,291)个(0,190)也(0,176)说(0,200)我(0,196)脚(0,195)又(0,202)未(0,204)踏(0,175)实(0,497)地\n[126318,1996](0,471)爱(0,205)上(0,225)你(0,239)不(0,233)过(0,196)为(0,201)逃(0,218)避\n[128014,3355](0,740)郑(0,125)融(0,214)我(0,210)也(0,191)告(0,156)诉(0,278)你(0,191)我(0,184)实(0,226)在(0,213)是(0,187)着(0,433)地\n[131069,3327](0,519)难(0,235)成(0,278)大(0,327)器(0,210)但(0,190)我(0,221)爱(0,201)得(0,222)起(0,313)Let(0,1) (0,190)s(0,1) (0,228)do(0,1) (0,182)it\n[134096,7375](0,2038)周(0,228)柏(0,177)豪(0,186)真(0,197)的(0,257)好(0,214)想(0,206)精(0,239)於(0,210)某(0,205)事(0,783)情(0,279)好(0,312)想(0,281)好(0,293)好(0,240)的(0,359)打(0,669)拚\n[141171,4821](0,572)可(0,294)惜(0,278)得(0,186)到(0,327)只(0,290)有(0,496)劣(0,213)而(0,212)没(0,257)有(0,275)半(0,201)粒(0,1213)星\n[145692,4733](0,498)真(0,178)的(0,322)不(0,200)想(0,224)早(0,186)给(0,298)你(0,291)定(0,612)型(0,301)笑(0,325)我(0,258)那(0,312)麽(0,296)的(0,183)拚(0,246)命\n[150125,4885](0,813)几(0,283)年(0,293)来(0,273)毫(0,278)无(0,260)成(0,941)绩(0,315)地(0,232)位(0,215)未(0,205)有(0,381)跃(0,393)升\n[154710,4796](0,522)郑(0,222)融(0,224)高(0,205)峰(0,196)上(0,171)不(0,1001)成(0,205)唯(0,508)盼(0,278)爱(0,307)情(0,298)顺(0,653)景\n[159206,4827](0,500)成(0,577)就(0,395)在(0,161)平(0,118)凡(0,1041)里(0,208)那(0,543)份(0,607)温(0,670)馨\n[163733,4347](0,563)周(0,195)柏(0,181)豪(0,425)已(0,547)试(0,537)着(0,157)生(0,184)性(0,323)但(0,219)求(0,201)大(0,195)众(0,188)都(0,237)尊(0,195)敬\n[167780,7194](0,1179)竟(0,249)然(0,542)凡(0,188)事(0,193)都(0,268)失(0,1090)败(0,225)也(0,228)许(0,278)得(0,283)爱(0,269)恋(0,334)先(0,188)可(0,195)以(0,204)得(0,1277)胜\n[177994,7926](0,492)即(0,189)使(0,402)险(7835,6834)胜\n',
        autoplay: true
      },
      musicList: [
        {
          title: '白羊',
          artist: '徐秉龙',
          src: 'http://m8.music.126.net/20200607160502/d62b8d5dc9c90c93a151914be957a617/ymusic/25a2/4ff4/52fc/d664724d25de35a8d4e23c1b986c60b5.mp3',
          pic: 'https://p1.music.126.net/tczb_7II9KzSuLQsVt89Gw==/109951163049336667.jpg'
        },
        {
          title: '说谎',
          artist: '林宥嘉',
          src: 'http://m7.music.126.net/20200607161953/af2e67e22c2407fea966c46769106159/ymusic/05ee/4458/4a12/e3ea4813e0c4abafe6c3d40b13cb9f65.mp3',
          pic: 'https://p2.music.126.net/mMZNB-jhYsw29K61QtopJA==/109951163187404137.jpg'
        },
        {
          title: '成都',
          artist: '赵雷',
          src: 'http://m7.music.126.net/20200607162234/8629f14056f784879d33dedbab34bf03/ymusic/fa90/df9c/59f7/95c4a2802e0b9191ae1a048f127e53c5.mp3',
          pic: 'https://p1.music.126.net/34YW1QtKxJ_3YnX9ZzKhzw==/2946691234868155.jpg'
        },
        {
          title: '陪你到底',
          artist: '许华升',
          src: 'http://m7.music.126.net/20200607161155/1ddfddaa4d9a7c3100c3e7329ce8e3da/ymusic/540f/005e/065e/ce65b58fea742cac390e1499eb32db98.mp3',
          pic: 'https://p1.music.126.net/a7QkLGexMQGT2lF3mqcUdw==/109951163693319625.jpg'
        },
        {
          title: '广东爱情故事',
          artist: '雨神',
          src: 'http://m7.music.126.net/20200607160858/6143003bbb9021f13678624978f9ba14/ymusic/c69c/aeed/2bd9/57487636f38ec8ef9355bf67d0741dfe.mp3',
          pic: 'https://p1.music.126.net/gjvguk9I-QwuyWFjQHM9SA==/109951163189947600.jpg'
        },
        {
          title: '烟火里的尘埃',
          artist: '华晨宇',
          src: 'http://m8.music.126.net/20200607161716/e2266bad871c28351a3ce257061b3310/ymusic/5d63/5150/0851/5f226aac018cafc2cb248f7d28fbd5b4.mp3',
          pic: 'https://p1.music.126.net/_49Xz_x9kTTdEgmYYk6w2w==/6672936069046297.jpg'
        }
      ]
    }
  },
  created () {
    this.$root.$on('songId', (value) => {
      console.log(value)
      this.playMusic(value)
    })
    // 获取歌曲信息
    this.$musicApi({
      url: '/song/detail',
      method: 'get',
      params: {
        ids: this.id
      }
    }).then((res) => {
      this.audio.name = res.data.songs[0].name
      this.audio.artist = res.data.songs[0].ar[0].name
      this.audio.cover = res.data.songs[0].al.picUrl
      console.log(this.audio.name)
    })
    // 获取歌词
    this.$musicApi({
      url: '/lyric',
      method: 'get',
      params: {
        id: this.id
      }
    }).then((res) => {
      const lrc = (this.audio.lrc = res.data.lrc.lyric)
      this.audio.lrc = lrc
    })
    // }
    // 获取歌曲音源
    this.$musicApi({
      url: '/song/url',
      method: 'get',
      params: {
        id: this.id
      }
    }).then((res) => {
      const url = res.data.data[0].url
      console.log(res.data.data[0].url)
      // 设置播放地址
      this.audio.url = url
    })
  },
  methods: {
    playMusic (songId) {
      this.$musicApi({
        url: '/song/detail',
        method: 'get',
        params: {
          ids: songId
        }
      }).then((res) => {
        this.audio.name = res.data.songs[0].name
        this.audio.artist = res.data.songs[0].ar[0].name
        this.audio.cover = res.data.songs[0].al.picUrl
        console.log(this.audio.name)
      })
      // 获取歌词
      this.$musicApi({
        url: '/lyric',
        method: 'get',
        params: {
          id: songId
        }
      }).then((res) => {
        const lrc = (this.audio.lrc = res.data.lrc.lyric)
        this.audio.lrc = lrc
      })
      // }
      // 获取歌曲音源
      this.$musicApi({
        url: '/song/url',
        method: 'get',
        params: {
          id: songId
        }
      }).then((res) => {
        const url = res.data.data[0].url
        console.log(res.data.data[0].url)
        // 设置播放地址
        this.audio.url = url
      })
    }
  }
}
</script>

<style scoped>
</style>
